Ran Plan for dir: `projects/dev` workspace: `default`

<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.argocd.helm_release.argocd will be created
+ resource "helm_release" "argocd" {
      + atomic                     = false
      + chart                      = "argo/argo-cd"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "argocd"
      + namespace                  = "argocd"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://argoproj.github.io/argo-helm"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                # TLS settings
                server:
                  extraArgs:
                    - --insecure
                configs:
                  params:
                    server.insecure: true
                
                # argocd-vault-plugin
                repoServer:
                  rbac:
                    - verbs:
                        - get
                      apiGroups:
                        - ''
                      resources:
                        - secrets
                
                  # Mount SA token for Kubernets auth
                  # Note: In 2.4.0 onward, there is a dedicated SA for repo-server (not default)
                  # Note: This is not fully supported for Kubernetes < v1.19
                  automountServiceAccountToken: true
                
                  # Each of the embedded YAMLs inside cmp-plugin ConfigMap will be mounted into it's respective plugin sidecar
                  volumes:
                    - configMap:
                        name: cmp-plugin
                      name: cmp-plugin
                    - name: custom-tools
                      emptyDir: {}
                
                  # Download tools
                  initContainers:
                    - name: download-tools
                      image: alpine:3.19 
                      env:
                        - name: AVP_VERSION
                          value: 1.18.0
                      command: [sh, -c]
                      args:
                        - >-
                          apk add --no-cache curl &&
                          curl -L https://github.com/argoproj-labs/argocd-vault-plugin/releases/download/v$(AVP_VERSION)/argocd-vault-plugin_$(AVP_VERSION)_linux_amd64 -o argocd-vault-plugin &&
                          chmod +x argocd-vault-plugin &&
                          mv argocd-vault-plugin /custom-tools/
                      volumeMounts:
                        - mountPath: /custom-tools
                          name: custom-tools
                
                  # sidecar containers
                  extraContainers:
                
                    # argocd-vault-plugin with Helm
                    - name: avp-helm
                      command: [/var/run/argocd/argocd-cmp-server]
                      image: quay.io/argoproj/argocd:v2.13.4
                      securityContext:
                        runAsNonRoot: true
                        runAsUser: 999
                      volumeMounts:
                        - mountPath: /var/run/argocd
                          name: var-files
                        - mountPath: /home/argocd/cmp-server/plugins
                          name: plugins
                        - mountPath: /tmp
                          name: tmp
                
                        # Register plugins into sidecar
                        - mountPath: /home/argocd/cmp-server/config/plugin.yaml
                          subPath: avp-helm.yaml
                          name: cmp-plugin
                
                        # Important: Mount tools into $PATH
                        - name: custom-tools
                          subPath: argocd-vault-plugin
                          mountPath: /usr/local/bin/argocd-vault-plugin
                
                    # argocd-vault-plugin with Kustomize
                    - name: avp-kustomize
                      command: [/var/run/argocd/argocd-cmp-server]
                      image: quay.io/argoproj/argocd:v2.13.4
                      securityContext:
                        runAsNonRoot: true
                        runAsUser: 999
                      volumeMounts:
                        - mountPath: /var/run/argocd
                          name: var-files
                        - mountPath: /home/argocd/cmp-server/plugins
                          name: plugins
                        - mountPath: /tmp
                          name: tmp
                
                        # Register plugins into sidecar
                        - mountPath: /home/argocd/cmp-server/config/plugin.yaml
                          subPath: avp-kustomize.yaml
                          name: cmp-plugin
                
                        # Important: Mount tools into $PATH
                        - name: custom-tools
                          subPath: argocd-vault-plugin
                          mountPath: /usr/local/bin/argocd-vault-plugin
                
                    # argocd-vault-plugin with plain YAML
                    - name: avp
                      command: [/var/run/argocd/argocd-cmp-server]
                      image: quay.io/argoproj/argocd:v2.13.4
                      securityContext:
                        runAsNonRoot: true
                        runAsUser: 999
                      volumeMounts:
                        - mountPath: /var/run/argocd
                          name: var-files
                        - mountPath: /home/argocd/cmp-server/plugins
                          name: plugins
                        - mountPath: /tmp
                          name: tmp
                
                        # Register plugins into sidecar
                        - mountPath: /home/argocd/cmp-server/config/plugin.yaml
                          subPath: avp.yaml
                          name: cmp-plugin
                
                        # Important: Mount tools into $PATH
                        - name: custom-tools
                          subPath: argocd-vault-plugin
                          mountPath: /usr/local/bin/argocd-vault-plugin
                
                # If you face issue with ArgoCD CRDs installation, then uncomment below section to disable it
                #crds:
                #  install: false
            EOT,
        ]
      + verify                     = false
      + version                    = "7.7.22"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.argocd.kubernetes_manifest.argocd_gateway will be created
+ resource "kubernetes_manifest" "argocd_gateway" {
      + manifest = {
          + apiVersion = "networking.istio.io/v1beta1"
          + kind       = "VirtualService"
          + metadata   = {
              + name      = "argocd-vs"
              + namespace = "argocd"
            }
          + spec       = {
              + gateways = [
                  + "istio-system/istio-ingressgateway",
                ]
              + hosts    = [
                  + "argocd.goboolean.io",
                ]
              + http     = [
                  + {
                      + route = [
                          + {
                              + destination = {
                                  + host = "argocd-server.argocd.svc.cluster.local"
                                  + port = {
                                      + number = 80
                                    }
                                }
                            },
                        ]
                    },
                ]
            }
        }
      + object   = {
          + apiVersion = "networking.istio.io/v1beta1"
          + kind       = "VirtualService"
          + metadata   = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "argocd-vs"
              + namespace                  = "argocd"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + spec       = {
              + exportTo = (known after apply)
              + gateways = [
                  + "istio-system/istio-ingressgateway",
                ]
              + hosts    = [
                  + "argocd.goboolean.io",
                ]
              + http     = [
                  + {
                      + corsPolicy       = {
                          + allowCredentials    = (known after apply)
                          + allowHeaders        = (known after apply)
                          + allowMethods        = (known after apply)
                          + allowOrigin         = (known after apply)
                          + allowOrigins        = (known after apply)
                          + exposeHeaders       = (known after apply)
                          + maxAge              = (known after apply)
                          + unmatchedPreflights = (known after apply)
                        }
                      + delegate         = {
                          + name      = (known after apply)
                          + namespace = (known after apply)
                        }
                      + directResponse   = {
                          + body   = {
                              + bytes  = (known after apply)
                              + string = (known after apply)
                            }
                          + status = (known after apply)
                        }
                      + fault            = {
                          + abort = {
                              + grpcStatus = (known after apply)
                              + http2Error = (known after apply)
                              + httpStatus = (known after apply)
                              + percentage = {
                                  + value = (known after apply)
                                }
                            }
                          + delay = {
                              + exponentialDelay = (known after apply)
                              + fixedDelay       = (known after apply)
                              + percent          = (known after apply)
                              + percentage       = {
                                  + value = (known after apply)
                                }
                            }
                        }
                      + headers          = {
                          + request  = {
                              + add    = (known after apply)
                              + remove = (known after apply)
                              + set    = (known after apply)
                            }
                          + response = {
                              + add    = (known after apply)
                              + remove = (known after apply)
                              + set    = (known after apply)
                            }
                        }
                      + match            = (known after apply)
                      + mirror           = {
                          + host   = (known after apply)
                          + port   = {
                              + number = (known after apply)
                            }
                          + subset = (known after apply)
                        }
                      + mirrorPercent    = (known after apply)
                      + mirrorPercentage = {
                          + value = (known after apply)
                        }
                      + mirror_percent   = (known after apply)
                      + mirrors          = (known after apply)
                      + name             = (known after apply)
                      + redirect         = {
                          + authority    = (known after apply)
                          + derivePort   = (known after apply)
                          + port         = (known after apply)
                          + redirectCode = (known after apply)
                          + scheme       = (known after apply)
                          + uri          = (known after apply)
                        }
                      + retries          = {
                          + attempts              = (known after apply)
                          + perTryTimeout         = (known after apply)
                          + retryOn               = (known after apply)
                          + retryRemoteLocalities = (known after apply)
                        }
                      + rewrite          = {
                          + authority       = (known after apply)
                          + uri             = (known after apply)
                          + uriRegexRewrite = {
                              + match   = (known after apply)
                              + rewrite = (known after apply)
                            }
                        }
                      + route            = [
                          + {
                              + destination = {
                                  + host   = "argocd-server.argocd.svc.cluster.local"
                                  + port   = {
                                      + number = 80
                                    }
                                  + subset = (known after apply)
                                }
                              + headers     = {
                                  + request  = {
                                      + add    = (known after apply)
                                      + remove = (known after apply)
                                      + set    = (known after apply)
                                    }
                                  + response = {
                                      + add    = (known after apply)
                                      + remove = (known after apply)
                                      + set    = (known after apply)
                                    }
                                }
                              + weight      = (known after apply)
                            },
                        ]
                      + timeout          = (known after apply)
                    },
                ]
              + tcp      = (known after apply)
              + tls      = (known after apply)
            }
        }
    }

  # module.argocd.kubernetes_secret.argocd_vault_plugin_credentials will be created
+ resource "kubernetes_secret" "argocd_vault_plugin_credentials" {
      + data                           = (sensitive value)
      + id                             = (known after apply)
      + type                           = "Opaque"
      + wait_for_service_account_token = true

      + metadata {
          + generation       = (known after apply)
          + name             = "argocd-vault-plugin-credentials"
          + namespace        = "argocd"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d projects/dev`
* :put_litter_in_its_place: To **delete** this plan click [here](http://34.64.35.124/lock?id=goboolean%252Finfrastructure%252Fprojects%252Fdev%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d projects/dev`
</details>
Plan: 3 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
